justinjohnso/soundmesh/firmware/idf/apps/tx/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"

# WiFi Mesh
#CONFIG_ESP_WIFI_MESH_ENABLE=y

# Audio Performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# ESP-ADF Compatibility
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# USB OTG (TinyUSB via esp_tinyusb component)
# Note: TinyUSB is now managed by esp_tinyusb component
# Audio device configuration requires custom descriptors